Tekla.Structures.DirectManipulation.Adapter.Controls.IPreviewProvider
The Tekla.Structures.DirectManipulation.Adapter.Controls.IPreviewProvider interfaces the preview provider for contextual tools.

Tekla.Structures.DirectManipulation.Adapter.Controls.IPreviewProvider.Register(System.Type,System.Func{System.Collections.Generic.IEnumerable{Tekla.BIM.DirectManipulation.Services.Controls.IControl}})
Registers the handler associated with the specified object type.
objectType: The target object type.
handler: The handler.